framework/storage/xml/pedimento/listarpedimentos.xml

<?xml version="1.0"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:lis="http://www.ventanillaunica.gob.mx/pedimentos/ws/oxml/listarpedimentos">
 	<soapenv:Header>
		<wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" soapenv:mustUnderstand="1">
		 	<wsse:UsernameToken>
		 		<wsse:Username/>
		 		<wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText"/>
		 	</wsse:UsernameToken>
	 	</wsse:Security>
	</soapenv:Header>
	<soapenv:Body>
		<lis:consultarPedimentosPeticion>
			<lis:peticion>
				<lis:aduana/>
			 	<lis:patente/>
			 	<lis:pedimento/>
			 	<lis:eDocumentCove/>
			 	<lis:rfc></lis:rfc>
			 	<lis:contenedor/>
			 	<lis:guia/>
			 	<lis:fechaInicio/>
			 	<lis:fechaFin/>
		 	</lis:peticion>
		</lis:consultarPedimentosPeticion>
	</soapenv:Body>
</soapenv:Envelope>
